rails_app/app/controllers/users_controller.rb

SELECT "investments".* FROM "investments" WHERE "investments"."owner_id" = 1 AND "investments"."value_type" = 'FB_LIKES' AND "investments"."purchase_price" = 1 AND "investments"."subject" = 'JustinBieber' AND "investments"."subject_value" = '77471439,' ORDER BY "investments"."id" ASC LIMIT 1
INSERT INTO "investments" ("created_at", "num_shares", "owner_id", "purchase_price", "subject", "subject_value", "updated_at", "value_type") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "balance" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["balance", 99], ["updated_at", Sun, 11 Jan 2015 19:13:54 UTC +00:00]]
---
  def create
  	puts "PARAMSSSS" + params.to_s
  	old_investment = Investment.where(
  		owner_id: params["userId"],
  		value_type: params["valueType"],
  		purchase_price: params["price"],
  		subject: params["subjectName"],
  		subject_value: params["value"]
  		).first
    puts "OLD INVESTMENT #{old_investment.to_s}"
  	new_num_shares = old_investment == nil ?
  		1 : old_investment["num_shares"] + 1;
  	@investment = Investment.new(
  		"purchase_price" => params["price"],
  		"num_shares" => new_num_shares,
  		"subject" => params["subjectName"],
  		"subject_value" => params["value"],
  		"value_type" => params["valueType"],
  		"owner_id" => params["userId"]
  		)
    puts "NEW INVESTMENT #{@investment.to_s}"
  	@investment.save
  	@user = User.find(params["userId"].to_i)
    @user.decrement!(:balance, params["price"].to_i)